fpistm/Arduino_Core_STM32/variants/STM32C5xx/C593V(E-G)T_C5A3VGT/PeripheralPins.c
#if defined(USE_HAL_ETH_MODULE) && (USE_HAL_ETH_MODULE == 1U)
WEAK const PinMap PinMap_Ethernet[] = {
  {PA_0,       ETH, STM_PIN_DATA(STM_MODE_AF_PP, LL_GPIO_PULL_UP, HAL_GPIO_AF_10)}, // ETH1_MII_CRS
  {PA_1,       ETH, STM_PIN_DATA(STM_MODE_AF_PP, LL_GPIO_PULL_UP, HAL_GPIO_AF_10)}, // ETH1_MII_RX_CLK
  {PA_1_ALT1,  ETH, STM_PIN_DATA(STM_MODE_AF_PP, LL_GPIO_PULL_UP, HAL_GPIO_AF_10)}, // ETH1_RMII_REF_CLK
  {PA_2,       ETH, STM_PIN_DATA(STM_MODE_AF_PP, LL_GPIO_PULL_UP, HAL_GPIO_AF_10)}, // ETH1_MDIO
  {PA_3,       ETH, STM_PIN_DATA(STM_MODE_AF_PP, LL_GPIO_PULL_UP, HAL_GPIO_AF_10)}, // ETH1_MII_COL
  {PA_5,       ETH, STM_PIN_DATA(STM_MODE_AF_PP, LL_GPIO_PULL_UP, HAL_GPIO_AF_10)}, // ETH1_MII_TX_EN
  {PA_5_ALT1,  ETH, STM_PIN_DATA(STM_MODE_AF_PP, LL_GPIO_PULL_UP, HAL_GPIO_AF_10)}, // ETH1_RMII_TX_EN
  {PA_7,       ETH, STM_PIN_DATA(STM_MODE_AF_PP, LL_GPIO_PULL_UP, HAL_GPIO_AF_10)}, // ETH1_MII_RX_DV
  {PA_7_ALT1,  ETH, STM_PIN_DATA(STM_MODE_AF_PP, LL_GPIO_PULL_UP, HAL_GPIO_AF_10)}, // ETH1_RMII_CRS_DV
  {PA_9,       ETH, STM_PIN_DATA(STM_MODE_AF_PP, LL_GPIO_PULL_UP, HAL_GPIO_AF_10)}, // ETH1_MII_TX_ER
  {PA_10,      ETH, STM_PIN_DATA(STM_MODE_AF_PP, LL_GPIO_PULL_UP, HAL_GPIO_AF_13)}, // ETH1_CLK
  {PA_15,      ETH, STM_PIN_DATA(STM_MODE_AF_PP, LL_GPIO_PULL_UP, HAL_GPIO_AF_10)}, // ETH1_PHY_INTN
  {PB_0,       ETH, STM_PIN_DATA(STM_MODE_AF_PP, LL_GPIO_PULL_UP, HAL_GPIO_AF_10)}, // ETH1_MII_RXD2
  {PB_1,       ETH, STM_PIN_DATA(STM_MODE_AF_PP, LL_GPIO_PULL_UP, HAL_GPIO_AF_10)}, // ETH1_MII_RXD3
  {PB_2,       ETH, STM_PIN_DATA(STM_MODE_AF_PP, LL_GPIO_PULL_UP, HAL_GPIO_AF_13)}, // ETH1_MII_RXD0
  {PB_2_ALT1,  ETH, STM_PIN_DATA(STM_MODE_AF_PP, LL_GPIO_PULL_UP, HAL_GPIO_AF_13)}, // ETH1_RMII_RXD0
  {PB_3,       ETH, STM_PIN_DATA(STM_MODE_AF_PP, LL_GPIO_PULL_UP, HAL_GPIO_AF_12)}, // ETH1_MDC
  {PB_4,       ETH, STM_PIN_DATA(STM_MODE_AF_PP, LL_GPIO_PULL_UP, HAL_GPIO_AF_12)}, // ETH1_MDIO
  {PB_5,       ETH, STM_PIN_DATA(STM_MODE_AF_PP, LL_GPIO_PULL_UP, HAL_GPIO_AF_10)}, // ETH1_PPS_OUT
  {PB_6,       ETH, STM_PIN_DATA(STM_MODE_AF_PP, LL_GPIO_PULL_UP, HAL_GPIO_AF_12)}, // ETH1_MII_TX_ER
  {PB_8,       ETH, STM_PIN_DATA(STM_MODE_AF_PP, LL_GPIO_PULL_UP, HAL_GPIO_AF_10)}, // ETH1_MII_TXD3
  {PB_10,      ETH, STM_PIN_DATA(STM_MODE_AF_PP, LL_GPIO_PULL_UP, HAL_GPIO_AF_10)}, // ETH1_MII_RX_ER
  {PB_12,      ETH, STM_PIN_DATA(STM_MODE_AF_PP, LL_GPIO_PULL_UP, HAL_GPIO_AF_10)}, // ETH1_MII_TXD0
  {PB_12_ALT1, ETH, STM_PIN_DATA(STM_MODE_AF_PP, LL_GPIO_PULL_UP, HAL_GPIO_AF_10)}, // ETH1_RMII_TXD0
  {PB_13,      ETH, STM_PIN_DATA(STM_MODE_AF_PP, LL_GPIO_PULL_UP, HAL_GPIO_AF_10)}, // ETH1_MII_TX_EN
  {PB_13_ALT1, ETH, STM_PIN_DATA(STM_MODE_AF_PP, LL_GPIO_PULL_UP, HAL_GPIO_AF_10)}, // ETH1_RMII_TX_EN
  {PB_15,      ETH, STM_PIN_DATA(STM_MODE_AF_PP, LL_GPIO_PULL_UP, HAL_GPIO_AF_10)}, // ETH1_MII_TXD1
  {PB_15_ALT1, ETH, STM_PIN_DATA(STM_MODE_AF_PP, LL_GPIO_PULL_UP, HAL_GPIO_AF_10)}, // ETH1_RMII_TXD1
  {PC_1,       ETH, STM_PIN_DATA(STM_MODE_AF_PP, LL_GPIO_PULL_UP, HAL_GPIO_AF_10)}, // ETH1_MDC
  {PC_2,       ETH, STM_PIN_DATA(STM_MODE_AF_PP, LL_GPIO_PULL_UP, HAL_GPIO_AF_10)}, // ETH1_MII_TXD2
  {PC_3,       ETH, STM_PIN_DATA(STM_MODE_AF_PP, LL_GPIO_PULL_UP, HAL_GPIO_AF_10)}, // ETH1_MII_TX_CLK
  {PC_4,       ETH, STM_PIN_DATA(STM_MODE_AF_PP, LL_GPIO_PULL_UP, HAL_GPIO_AF_12)}, // ETH1_MII_RXD0
  {PC_4_ALT1,  ETH, STM_PIN_DATA(STM_MODE_AF_PP, LL_GPIO_PULL_UP, HAL_GPIO_AF_12)}, // ETH1_RMII_RXD0
  {PC_5,       ETH, STM_PIN_DATA(STM_MODE_AF_PP, LL_GPIO_PULL_UP, HAL_GPIO_AF_13)}, // ETH1_MII_RXD1
  {PC_5_ALT1,  ETH, STM_PIN_DATA(STM_MODE_AF_PP, LL_GPIO_PULL_UP, HAL_GPIO_AF_13)}, // ETH1_RMII_RXD1
  {PC_10,      ETH, STM_PIN_DATA(STM_MODE_AF_PP, LL_GPIO_PULL_UP, HAL_GPIO_AF_10)}, // ETH1_MII_TXD0
  {PC_10_ALT1, ETH, STM_PIN_DATA(STM_MODE_AF_PP, LL_GPIO_PULL_UP, HAL_GPIO_AF_10)}, // ETH1_RMII_TXD0
  {PC_12,      ETH, STM_PIN_DATA(STM_MODE_AF_PP, LL_GPIO_PULL_UP, HAL_GPIO_AF_10)}, // ETH1_PPS_OUT
  {PD_1,       ETH, STM_PIN_DATA(STM_MODE_AF_PP, LL_GPIO_PULL_UP, HAL_GPIO_AF_10)}, // ETH1_MII_RX_DV
  {PD_1_ALT1,  ETH, STM_PIN_DATA(STM_MODE_AF_PP, LL_GPIO_PULL_UP, HAL_GPIO_AF_10)}, // ETH1_RMII_CRS_DV
  {PD_4,       ETH, STM_PIN_DATA(STM_MODE_AF_PP, LL_GPIO_PULL_UP, HAL_GPIO_AF_10)}, // ETH1_CLK
  {PD_5,       ETH, STM_PIN_DATA(STM_MODE_AF_PP, LL_GPIO_PULL_UP, HAL_GPIO_AF_10)}, // ETH1_MII_CRS
  {PD_8,       ETH, STM_PIN_DATA(STM_MODE_AF_PP, LL_GPIO_PULL_UP, HAL_GPIO_AF_10)}, // ETH1_MII_RXD0
  {PD_8_ALT1,  ETH, STM_PIN_DATA(STM_MODE_AF_PP, LL_GPIO_PULL_UP, HAL_GPIO_AF_10)}, // ETH1_RMII_RXD0
  {PD_10,      ETH, STM_PIN_DATA(STM_MODE_AF_PP, LL_GPIO_PULL_UP, HAL_GPIO_AF_10)}, // ETH1_MII_CRS
  {PD_11,      ETH, STM_PIN_DATA(STM_MODE_AF_PP, LL_GPIO_PULL_UP, HAL_GPIO_AF_10)}, // ETH1_PTP_AUX_TS
  {PE_2,       ETH, STM_PIN_DATA(STM_MODE_AF_PP, LL_GPIO_PULL_UP, HAL_GPIO_AF_10)}, // ETH1_MII_TXD3
  {PE_4,       ETH, STM_PIN_DATA(STM_MODE_AF_PP, LL_GPIO_PULL_UP, HAL_GPIO_AF_10)}, // ETH1_MII_RXD0
  {PE_4_ALT1,  ETH, STM_PIN_DATA(STM_MODE_AF_PP, LL_GPIO_PULL_UP, HAL_GPIO_AF_10)}, // ETH1_RMII_RXD0
  {PE_5,       ETH, STM_PIN_DATA(STM_MODE_AF_PP, LL_GPIO_PULL_UP, HAL_GPIO_AF_10)}, // ETH1_MII_RXD1
  {PE_5_ALT1,  ETH, STM_PIN_DATA(STM_MODE_AF_PP, LL_GPIO_PULL_UP, HAL_GPIO_AF_10)}, // ETH1_RMII_RXD1
  {PE_12,      ETH, STM_PIN_DATA(STM_MODE_AF_PP, LL_GPIO_PULL_UP, HAL_GPIO_AF_10)}, // ETH1_MDIO
  {NC,         NP,  0}
};
#endif

//*** No QUADSPI ***

//*** USB ***

#if defined(USE_HAL_PCD_MODULE) && (USE_HAL_PCD_MODULE == 1U) ||\
    defined(USE_HAL_HCD_MODULE) && (USE_HAL_HCD_MODULE == 1U)
WEAK const PinMap PinMap_USB[] = {
  {PA_8,  USB, STM_PIN_DATA(STM_MODE_AF_PP, LL_GPIO_PULL_UP, HAL_GPIO_AF_13)}, // USB_SOF
  {PA_11, USB, STM_PIN_DATA(STM_MODE_AF_PP, LL_GPIO_PULL_NO, HAL_GPIO_AF_7)}, // USB_DM
  {PA_12, USB, STM_PIN_DATA(STM_MODE_AF_PP, LL_GPIO_PULL_NO, HAL_GPIO_AF_7)}, // USB_DP
  {NC,    NP,  0}
};
#endif

//*** No SD ***

#endif /* !CUSTOM_PERIPHERAL_PINS */
